import { Theme } from "../LearnBook";

const themeJavaScript: Theme[] = [
  {
    title: "Введение",
    points: [
      "История языка",
      "Где используется",
      "Секреты браузера",
      "Что будет дальше",
    ],
  },
  {
    title: "Синтаксис",
    points: [
      "Любой код",
      "Переменные",
      "Типы данных",
      "Условия",
      "Циклы",
      "Функции",
      "Массивы",
      "Объекты",
      "Булева алгебра",
      "Взаимодействие с пользователем",
    ],
  },
  {
    title: "Важные моменты",
    points: [
      "Дебагинг",
      "Стиль кода",
      "Частые ошибки",
      "Создание доки",
      "Масштабируемость",
      "Не изобретай велосипед",
    ],
  },
  {
    title: "Переменные в JS",
    points: [
      "Примитивы и объекты",
      "Числа",
      "Строки",
      "Булевые значения",
      "null и undefined",
      "Разные объявления",
    ],
  },
  {
    title: "Функции в JS",
    points: [
      "Более подробно",
      "Стрелочные функции",
      "CallBack",
      "Замыкание",
      "Рекурсия",
      "Контекст",
    ],
  },
  {
    title: "Массивы в JS",
    points: [
      "Более подробно",
      "Основные методы",
      "Полезные методы",
      "Редкие методы",
      "N мерные массивы",
    ],
  },
  {
    title: "Классы в JS",
    points: ["Основы", "Наследование", "Свойства и методы", "Конструктор"],
  },
  {
    title: "Асинхронный код",
    points: ["setTimeout и setInterval", "Promise", "async/await"],
  },
  {
    title: "Модульность",
    points: ["Основы", "Экспорт и импорт", "Динамические импорты"],
  },
];

export default themeJavaScript;
