import { ITheme } from "../LearnBook";

const themeCss: ITheme[] = [
  {
    title: "Введение",
    points: [
      "История языка",
      "Где используется",
      "Секреты браузера",
      "Что будет дальше",
    ],
  },
  {
    title: "Основы",
    points: [
      "Селектор, свойство, значение",
      "Вложенные селекторы",
      "Правила приоритета",
      "Правила названия",
    ],
  },
  {
    title: "Всё для текста",
    points: ["Размеры", "Цвета", "Шрифты", "Декорирование", "Особенности"],
  },
  {
    title: "Всё для блоков",
    points: [
      "Размеры",
      "Фоны",
      "Расположение",
      "Особенности",
      "Рамка",
      "Градиенты",
      "Тень",
    ],
  },
  {
    title: "Псевдоэлементы и псевдоклассы",
    points: ["hover", "N элемент", "not", "focus", "before и after", "Другие"],
  },
  {
    title: "Блочная вёрстка (flex)",
    points: [
      "Базовое расположение",
      "Выравнивание",
      "Соотношения",
      "Лучшие практики",
    ],
  },
  {
    title: "Медиазапросы",
    points: ["@media", "Принципы работы"],
  },
  {
    title: "Позиционирование",
    points: ["relative", "absolute", "fixed"],
  },
  {
    title: "Современный css",
    points: ["calc()", "var()"],
  },
  {
    title: "Анимации",
    points: [
      "keyframes",
      "Временные функции",
      "Функция Безье",
      "Лучшие практики",
    ],
  },
];

export default themeCss;
